Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: མཁས་པ་ཤེས་རབ་ལྡན་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Scholar Endowed with Insight the one of miracles.

source: ཡིད་གཉིས་སྤོང་བར་བྱེད་པ་དགྲ་བཅོམ་པ། །འདུས་པ་དང་པོར་བྱེ་བ་བརྒྱ་ཕྲག་དགུ། །གཉིས་པར་བརྒྱད་ཡོད་གསུམ་པར་བདུན་ཡང་ཡོད། །
en: In the first congregation there will be nine billion Worthy ones who relinquish doubt. “In the second will be eight billion and in the third there will be seven billion.

source: བདེ་བར་གཤེགས་པ་ཟད་མཐར་ཕྱིན་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་གནས། །
en: And after this well-gone one has perfected exhaustion The sacred Dharma will remain for thirty million years.

source: སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །དཔག་ཚད་གསུམ་ཁྱོན་གསེར་གྱི་རྒྱལ་མཚན་བརྒྱན།། །།
en: “His relics will remain a single unit and there will be a single stūpa, Measuring three leagues and adorned with golden banners.

source: བདེ་བར་གཤེགས་པ་མེ་ཏོག་རྒྱལ་མཚན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོག་མ་ཞེས་ཀྱང་བྱ། །
en: The well-gone Puṣpaketu will be born In a place called Supreme.

source: དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་ངོ་ཚ་ཤེས། །འཛམ་བུའི་ཆུ་བོ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: And his light will extend five leagues. Conscientious will be his father and Jambu River his mother.

source: སྲས་པོ་བརྟན་ལྡན་དགའ་བ་རིམ་གྲོ་པ། །
en: Stability will be his son and Joy his attendant.

source: འཇིག་རྟེན་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Light of the World will be the scholar

source: ཡེ་ཤེས་ལྡན་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Endowed with Wisdom the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་བདུན་ཅུ་ཡོད། །གཉིས་པ་དག་ཏུ་སེམས་གྲོལ་བརྒྱད་ཅུ་ཡོད། །འདུས་པ་གསུམ་པར་བྱེ་བ་དགུ་བཅུ་ཡོད། །
en: In the first congregation there will be seven hundred million. In the second will be eight hundred million with liberated minds, “And in the third there will be nine hundred million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་དགུ། །
en: His lifespan will be ninety-nine thousand years,

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བྱེ་བ་ཕྲག་བཅུའི་བར་དུ་གནས། །
en: And after his nirvāṇa The sacred Dharma will remain for one hundred million years.

source: དེ་ཡི་མཆོད་རྟེན་བཟང་པོ་སྐུ་གདུང་བཅས། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་རྩ་གཉིས་འབྱུང་། །
en: “His fine stūpas containing relics Will number three hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བས་མཐོང་ཞེས་བྱ། །
en: The thus-gone Śailendrarāja will be born In a place called Seen with Delight.

source: དེ་ཡི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་དྲུག་ཡབ་ནི་བརྟུལ་ཞུགས་བཟང་། །སྦྱིན་ལ་དགའ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend sixteen leagues. Excellent Yogic Discipline will be his father and Delighting in Generosity his mother.

source: སྲས་པོ་ཙམ་ཀ་འོད་དབང་རིམ་གྲོ་པ། །
en: Campaka will be his son and Master of Light his attendant.

source: ཤེས་རབ་སྒྲ་སྐད་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: “Language of Insight will be the scholar

source: ཟླ་སྡུག་ཅེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Delightful Moon the one of miracles.

source: དགྲ་བཅོམ་དག་ནི་སྟོང་ཕྲག་བརྒྱད་ཅུ་སྟེ། །གཉིས་པར་བདུན་ཅུ་གསུམ་པར་དྲུག་ཅུ་ཡོད། །
en: Eighty thousand worthy ones will gather. The second congregation will have seventy thousand and the third sixty thousand.

source: མི་དེ་དག་གི་ཚེ་ཡི་ཚད་དག་ནི། །ལོ་ཡི་གྲངས་དག་བྱེ་བ་ཚང་བར་འགྱུར། །
en: “The lifespan of humans will be ten million years,

source: དེ་ཡི་མཆོད་རྟེན་གཅིག་འབྱུང་འཕང་དག་ཏུ། །དཔག་ཚད་གཅིག་ཡོད་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: “He will have a single stūpa of relics, Reaching one league high and studded with jewels.

source: དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་མཐོང་ཞེས་བྱ། །
en: The thus-gone Mahātejas will be born In a place called Seen Always.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་མུ་སྟེགས་བཟང་། །འབྲུག་སྒྲ་ཞེས་ནི་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be brahmin, And his light will extend two leagues. Excellent Steps will be his father and Sound of Thunder his mother.

source: སྲས་པོ་འཇམ་དགའ་འོད་ལྡན་རིམ་གྲོ་པ། །
en: Gentle Joy will be his son and Luminous his attendant.

source: སྐར་མདའ་འཕགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Superior Shooting Star will be the scholar

source: དཔའ་བར་གྲགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Heroic Fame the one of miracles.

source: དགྲ་བཅོམ་ང་མེད་སྟོང་ཕྲག་སུམ་ཅུ་གཉིས། །གཉིས་པ་དག་ཏུ་སྟོང་ཕྲག་སུམ་ཅུ་གཅིག །འདུས་པ་གསུམ་པར་སྟོང་ཕྲག་སུམ་ཅུ་ཡོད། །
en: There will be thirty-two thousand worthy ones without ‘I.’ In the second congregation will be thirty-one thousand And in the third there will be thirty thousand.

source: དེ་ཚེ་སྐུ་ཚེའི་ལོ་གྲངས་དྲུག་ཁྲི་ཡིན། །
en: At that time the span of life will be sixty thousand years,

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཚང་བར་གནས། །
en: And after this victor has attained nirvāṇa His sacred Dharma will remain complete for eighty thousand years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བདུན་ཅུ་དྲུག །
en: “His relics will be abundant, And there will be seven hundred sixty billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་དོན་མཛད་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཨུད་པལ་འདབ་ཅེས་བྱ། །
en: The thus-gone Kṛtārthadarśin will be born In a place called Utpala Petals.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དུང་ཕྱུར་བརྒྱད་ཡོད་ཡབ་ནི་འཇིགས་མེད་ཡིན། །དཔལ་གྱི་གཟི་བརྗིད་ཅེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: “His family will be brahmin, And his light will extend eight hundred million leagues. Fearless will be his father and Glorious Splendor his mother.

source: སྲས་པོ་རྣམ་སྒྲོགས་ཆོས་ལྡན་རིམ་གྲོ་པ། །
en: Proclaimer will be his son and Endowed with Dharma his attendant.

source: འོད་བཟངས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Excellent Light will be the scholar

source: བློ་གྲོས་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Intelligence the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་བཞི་བཅུ་རྩ་གསུམ་སྟེ། །འདུས་པ་གཉིས་པར་བྱེ་བ་བཞི་བཅུ་གཉིས། །འདུས་པ་གསུམ་པར་བྱེ་བ་བཞི་བཅུ་གཅིག །
en: Four hundred thirty million worthy ones will gather. In the second congregation will be four hundred twenty million, “And in the third there will be four hundred ten million.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཞི་བཅུ་དྲུག །
en: His lifespan will be forty-six thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་དྲུག་ཏུ་གནས། །
en: And after he has attained nirvāṇa His sacred Dharma will remain complete for eighty-six thousand years.

source: སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག་འབྱུང་ལ། །གདུགས་གྲངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་དག་གིས་ཁེབས། །
en: “His relics will remain in a single collection in a single stūpa Shielded by eighty thousand parasols.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་མཐའ་ཡས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་པད་མ་ངེས་ཞེས་བྱ། །
en: The thus-gone Amitayaśas will be born In a place called Certain Lotus.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་སྒྱུ་མེད་ཡིན། །བདེ་བར་སེམས་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be kṣatriya, And his light will extend nine leagues. Free from Deception will be his father and Blissful Mind his mother.

source: སྲས་པོ་གྲགས་དགའ་ཀླུ་ནི་རིམ་གྲོ་པ། །
en: Joyous Fame will be his son and Nāga his attendant.

source: གདོན་མི་ཟ་བའི་བློ་ནི་མཁས་པ་སྟེ། །
en: “Mind without Doubt will be the scholar

source: དགའ་བའི་ང་རོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Joyous Roar the one of miracles.

source: འདུས་པ་དང་པོར་དགྲ་བཅོམ་བྱེ་བ་ཕྲག །བདུན་ཅུ་གཉིས་པར་བྱེ་བ་དྲུག་ཅུ་ཡོད། །གསུམ་པ་དག་ཏུ་བྱེ་བ་ལྔ་བཅུ་ཡོད། །
en: In the first congregation there will be seven hundred million worthy ones, In the second there will be six hundred million, “And in the third there will be five hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་གྲངས་དྲུག་འབུམ་ཡིན། །
en: His lifespan will be six hundred thousand years,

source: བདེ་བར་གཤེགས་པ་ཟད་མཐར་ཕྱིན་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་གསུམ་དུ་གནས། །
en: And when this well-gone one has reached exhaustion His sacred Dharma will remain for thirty million years.

source: སྐུ་གདུང་རྒྱས་པའི་མཆོད་རྟེན་དུང་ཕྱུར་བདུན། །གདུགས་དང་རྒྱལ་མཚན་བ་དན་དག་གིས་བརྒྱན། །
en: “His abundant relics will be contained in seven hundred million stūpas Adorned with parasols and banners.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ལྷ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཨུད་པལ་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Ratnadeva will be born In a place called Adorned with Utpalas.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཉིས་ཡོད་ཡབ་ནི་དཔའ་བོ་ཡིན། །སཱ་ལའི་འོད་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be kṣatriya, And his light will extend two leagues. Hero will be his father and Śāla Light his mother.

source: སྲས་པོ་བཟང་དགའ་རྒྱལ་བ་རིམ་གྲོ་པ། །
en: Excellent Joy will be his son and Conqueror his attendant.

source: སྐར་འོད་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Starlight will be the scholar

source: གསེར་གྱི་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Golden Light the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་བརྒྱད་ཅུ་ཡོད། །གཉིས་པར་ལྔ་བཅུ་གསུམ་པར་སུམ་ཅུ་ཡོད། །
en: In the first congregation there will be eight hundred million, In the second there will be five hundred million, and in the third, three hundred million.

source: དེ་ཚེ་འགོག་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུའི་བར་དུ་གནས། །
en: And when this thus-gone one has gone to cessation His sacred Dharma will remain for ninety thousand years.

source: མཆོད་རྟེན་དཔག་ཚད་གཉིས་ཀྱི་ཁྱོན་ཙམ་ལ། །གདུགས་གྲངས་བྱེ་བ་ཕྲག་ནི་བརྒྱ་ཡིས་བསྐོར། །
en: “The stūpa will measure two leagues And be surrounded by a one billion parasols.

source: དེ་བཞིན་གཤེགས་པ་དོན་གནས་མཁྱེན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བརྒྱན་པ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Sthitārtha­jñānin will be born In a place called Adorned.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཉིས་ཡབ་ནི་དོན་གནས་ཡིན། །ཟླ་ལྡན་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be brahmin, And his light will extend twelve leagues. Meaningful Adherence will be his father and Moon Possessor his mother.

source: སྲས་པོ་ཟླ་སྡུག་དགའ་བ་རིམ་གྲོ་པ། །
en: Delightful Moon will be his son and Joy his attendant.

source: དཔལ་རྒྱས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Vast Glory will be the scholar

source: བརྟུལ་ཞུགས་སྙིང་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Essence of Yogic Discipline the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་ཉི་ཤུ་རྩ་གཉིས་ཏེ། །འདུས་པ་གཉིས་པར་ཉི་ཤུ་རྩ་ཡང་གཅིག །འདུས་པ་གསུམ་པར་ཉི་ཤུ་ཐམ་པ་ཡོད། །
en: There will be two hundred twenty million worthy ones. In the second congregation will be two hundred ten million, “And in the third there will be two hundred million.

source: མི་ཡི་ཚེ་ཚད་ལོ་གྲངས་བྱེ་བ་ཡིན། །
en: The lifespan of human beings will be ten million years,

source: རྡུལ་དང་བྲལ་བའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུར་གནས། །
en: And the sacred Dharma of this immaculate one Will remain for ninety-nine thousand years.

source: དེ་ཡི་མཆོད་རྟེན་དཔག་ཚད་བཞི་པ་ལ། །གདུགས་གྲངས་བྱེ་བ་དག་གིས་ལེགས་པར་བརྒྱན། །
en: “His stūpa will measure four leagues And be beautifully adorned with ten million parasols.

source: དེ་བཞིན་གཤེགས་པ་བློ་ནི་རྫོགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་འོད་ཅེས་བྱ། །
en: The thus-gone Pūrṇamati will be born In a place called Light of Merit.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཡོད་ཡབ་ནི་བློ་བཟངས་ཡིན། །པད་མ་ཅན་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend six leagues. Excellent Mind will be his father and Lotus Possessor his mother.

source: སྲས་པོ་སྙན་དགའ་དོ་ཤལ་རིམ་གྲོ་པ། །
en: Joyous Listening will be his son and Crystal his attendant.

source: བསོད་ནམས་ཡང་དག་འཕགས་པ་མཁས་པ་སྟེ། །
en: “Superior Merit will be the scholar

source: ཟླ་བའི་སྟོབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Moon Strength the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་བརྒྱད་ཅུ་ཡོད། །འདུས་པ་གཉིས་པར་འཇིགས་བྲལ་བདུན་ཅུ་ཡོད། །འདུས་པ་གསུམ་པར་བྱེ་བ་ཕྲག་སྟོང་ཡོད། །
en: In the first congregation there will be eight hundred million. In the second congregation will be seven hundred million fearless ones, “And in the third there will be ten billion.

source: སྐུ་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བདུན་ཅུ་དྲུག །
en: His lifespan will be seventy-six thousand years,

source: འཇིག་རྟེན་མཁྱེན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བྱེ་བ་ཉི་ཤུ་གསུམ་དུ་གནས། །
en: And the sacred Dharma of this knower of the world Will remain for two hundred thirty million years.

source: རྡུལ་བྲལ་མཆོད་རྟེན་བྱེ་བརྒྱ་དྲུག་ཅུ་བཞི། །ཐམས་ཅད་རྒྱང་གྲགས་གསུམ་གྱི་ཚད་ཙམ་ཡིན། །
en: “There will be sixty-four billion immaculate stūpas, Each measuring three krośas.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་མེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མདངས་འཕགས་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Aśoka will be born In a place called Superior Brightness.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་བཞི་ཡབ་ནི་ཟླ་རི་ཡིན། །ལེགས་སེམས་མ་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཡིད་འོང་སྡུག་པ་ཡོན་ཏན་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend fourteen leagues. Moon Mountain will be his father and Excellent Mind his mother. Beautiful Mind will be his son and Qualities his attendant.

source: ཆོས་མཐོང་བ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Dharma Perception will be the scholar

source: སེང་གེའི་སྟབས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Lion Strength the one of miracles.

source: འདུས་པ་དང་པོར་སྟོང་ཕྲག་སུམ་ཅུ་ཡོད། །འདུས་པ་གཉིས་པར་ཉི་ཤུ་རྩ་བརྒྱད་ཡོད། །
en: In the first congregation there will be thirty thousand, In the second will be twenty-eight thousand,

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས། །
en: And when this well-gone one has transcended suffering His sacred Dharma will remain for ninety thousand years.

source: དཔག་ཚད་གཅིག་པའི་མཆོད་རྟེན་ཐ་དད་པ། །རིན་ཆེན་མཆོག་མ་སྣ་བདུན་རང་བཞིན་ཡིན། །
en: There will be various stūpas measuring a league, “Which will be made by the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་དྲི་མ་བྲལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Vigatamala will be born In a place called Adorned with Jewels.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ལྷ་ལེགས་ཡིན། །
en: His family will be brahmin,

source: རབ་ཏུ་ཞི་ལྡན་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཟླ་སྡུག་ཡོན་ཏན་ཅན་ནི་རིམ་གྲོ་པ། །
en: “And his light will extend three leagues. Divine Excellence will be his father and Perfectly Serene his mother. Delightful Moon will be his son and Endowed with Qualities his attendant.

source: གླང་པོ་བསྒྱིངས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Striding Elephant will be the scholar

source: དགྲ་བཅོམ་བྱེ་བ་བརྒྱ་ཕྲག་ལྔ་ཡོད་དེ། །གཉིས་པར་བྱེ་བ་བརྒྱ་ཕྲག་གཉིས་ཀྱང་ཡོད། །གསུམ་པ་དག་ཏུ་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ། །
en: Five billion worthy ones will gather. In the second gathering will be two billion, And in the third there will be three billion.

source: སྐུ་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡིན། །
en: “His lifespan will be eighty-four thousand years,

source: རྐང་གཉིས་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་སྟོང་དུ་གནས། །
en: And when this supreme human one has transcended suffering His sacred Dharma will remain for ten billion years.

source: མཆོད་རྟེན་གཅིག་སྟེ་འཕང་དུ་དཔག་ཚད་གཅིག །གདུགས་མཆོག་སྟོང་ཕྲག་བཅུ་ཡིས་ཁྱབ་པར་འགྱུར། །
en: There will be single stūpa measuring a league “And adorned with ten thousand supreme parasols.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་ལྷ་སྐྱེ་བའི་ཡུལ། །བསོད་ནམས་དག་གིས་རྣམ་པར་བརྒྱན་ཅེས་བྱ། །
en: The thus-gone Brahmadeva will be born In a place called Adorned with Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཀུན་ཏུ་སུམ་ཅུ་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །ཡུམ་ནི་མེ་ཏོག་འོད་ཡིན་སྲས་པོ་ནི། །ཡོན་ཏན་བསགས་པ་འཇམ་པ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, “And his light will extend thirty leagues. Fine and Noble Mind will be his father and Flower Light his mother. Qualities Accumulated will be his son and Loving his attendant.

source: རྟ་དབང་ལྷ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Divine Horse Master will be the scholar

source: སྒྲ་གཅན་འཛིན་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Rāhu Holder the one of miracles.

source: ཡང་སྲིད་ཟད་པ་དགྲ་ནི་བཅོམ་པ་དག །འདུས་པ་དང་པོར་འབུམ་ཕྲག་ལྔ་ཡོད་དོ། །གཉིས་པར་དྲུག་ཅུ་གསུམ་པར་བདུན་ཅུ་བདུན། །
en: In the first congregation there will be five hundred thousand Worthy ones who have exhausted existence. In the second there will be six million and in the third, seven million seven hundred thousand.

source: རྒྱལ་བ་དམ་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སུམ་སྟོང་བར་དུ་གནས། །
en: And once this true victor has attained nirvāṇa His sacred Dharma will remain for three thousand years.

source: དེ་ཡི་སྐུ་གདུང་རིལ་པོ་གཅིག་ཡིན་ལ། །མཆོད་རྟེན་འཕང་དུ་དཔག་ཚད་གསུམ་ཙམ་འཕགས། །
en: His relics will remain in a single collection “Contained in a stūpa three leagues tall.

source: དེ་བཞིན་གཤེགས་པ་ས་ཡི་དབང་ཕྱུག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་དང་ལྡན་ཞེས་བྱ། །
en: The thus-gone Dharaṇīśvara will be born In a place called Splendid.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དྲུག་ཅུ་ཡབ་ནི་གཟུགས་བཟང་ཡིན། །ཆོས་ཀྱི་འོད་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: The family of this victor will be kṣatriya, “And his light will extend sixty leagues. Excellent Form will be his father and Dharma Light his mother.

source: སྲས་པོ་བདེ་དགའ་དགེ་བ་རིམ་གྲོ་པ། །
en: Blissful Joy will be his son and Virtue his attendant.

source: གཏི་མུག་སེལ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Dispeller of Dullness will be the scholar

source: དགའ་རྒྱལ་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Victorious Joy the one of miracles.

source: དགྲ་བཅོམ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་སྟེ། །འདུས་པ་གཉིས་པར་དྲུག་ཅུ་རྩ་ཡང་ལྔ། །འདུས་པ་གསུམ་པར་སྟོང་ཕྲག་དྲུག་ཅུ་ཡོད། །
en: Sixty-four thousand worthy ones will gather. In the second congregation will be sixty-five thousand, And in the third there will be sixty thousand.

source: མཚུངས་པ་མེད་པ་བདེ་བར་གཤེགས་པའི་ཆོས། །ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་གསུམ་དུ་གནས། །
en: And the Dharma of this incomparable well-gone one Will remain for thirty million years.

source: དེ་ཡི་སྐུ་གདུང་དག་ཀྱང་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུ་གཉིས། །
en: His relics will be abundant, “And there will be sixty-two billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྤྱན་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་སེམས་དང་འབྲེལ་ཞེས་བྱ། །
en: The thus-gone Kusumanetra will be born In a place called Mental Connection.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དྲུག་ཅུ་རྩ་གཉིས་ཡབ་ནི་སྐྱེ་དབང་ཡིན། །བློ་གྲོས་སེམས་མ་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: His family will be brahmin, “And his light will extend sixty-two leagues. Ruler of Men will be his father and Intelligent Mind his mother.

source: སྲས་པོ་བདེ་འགྲོ་མེ་ཏོག་རིམ་གྲོ་པ། །
en: Joyous World will be his son and Flower his attendant.

source: མྱ་ངན་སེལ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Dispeller of Pain will be the scholar

source: འགྲོ་བ་འཛིན་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Holder of the World the one of miracles.

source: འདུས་པ་དང་པོར་སྟོང་ཕྲག་དྲུག་ཅུ་ཡོད། །གཉིས་པར་བདུན་ཅུ་གསུམ་པར་བརྒྱད་ཅུ་ཡོད། །
en: In the first congregation there will be sixty thousand, The second will have seventy thousand, and the third, eighty thousand.

source: དེ་ཚེ་རྒྱལ་བ་དེ་ཡི་སྐུ་ཚེའི་ཚད། །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་དག་ཀྱང་ཡིན། །
en: At that time the lifespan of the victorious one “Will be ninety thousand years,

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་གཉིས་སུ་གནས། །
en: And the Dharma of the one who attained nirvāṇa Will remain for twenty million years.

source: མཆོད་རྟེན་བྱེ་བ་ཕྲག་ནི་བཅུ་ཡོད་ལ། །གསེར་གྱིས་བརྒྱན་ཅིང་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: There will be one hundred million stūpas “Decorated with gold and studded with jewels.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་འབྱེས་པའི་སྐུ། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་སྣ་ཚོགས་ཡིན། །
en: The thus-gone Vibhaktagātra will be born In a place called Various Jewels.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཕྱེད་ཡོད་ཡབ་ནི་གྲགས་དབང་པོ། །རྣམ་པར་སྣང་མཛད་ཅེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: His family will be brahmin, “And his light will extend half a league. Renowned Ruler will be his father and Illuminator his mother.

source: སྲས་པོ་རབ་འཕགས་མུ་སྟེགས་རིམ་གྲོ་པ། །
en: Superior will be his son and Steps his attendant.

source: ཕལ་ཆེན་སྦྱིན་པ་བདེན་སྨྲ་མཁས་པ་སྟེ། །
en: Vast Generosity will be the scholar

source: སེང་གེའི་ང་རོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: “And Lion’s Roar the one of miracles.

source: འདུས་པ་དང་པོར་དྲང་སྲོང་དགྲ་བཅོམ་པ། །བྱེ་བ་སྟོང་ཕྲག་དག་ནི་བཅུ་ཡོད་དོ། །གཉིས་པར་བརྒྱད་ཡོད་གསུམ་པར་བདུན་ཡོད་དོ། །
en: In the first congregation there will be One hundred billion worthy sages. In the second will be eighty billion, and in the third there will be seventy billion.

source: སངས་རྒྱས་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་ཕྲག་ལྔར་གནས། །
en: And once this buddha has attained nirvāṇa The sacred Dharma will remain for fifty million years.

source: མྱ་ངན་འདས་པའི་སྐུ་གདུང་རིལ་པོ་གཅིག །མཆོད་རྟེན་དཔག་ཚད་བདུན་པ་གཅིག་ཅིག་འབྱུང་། །
en: The relics of nirvāṇa will remain in a single collection “And there will be one stūpa, measuring seven leagues.

source: བདེ་བར་གཤེགས་པ་ཆོས་ཀྱི་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མདངས་མཐོང་ཞེས་ཀྱང་བྱ། །
en: The well-gone one Dharmaprabhāsa will be born In a place called Bright Sight.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་ཁྱད་པར་འཕགས། །རིན་ཆེན་ཆེན་མོ་ཡུམ་ཡིན་སྲས་པོ་ནི། །རབ་འཕགས་ངོ་ཚ་ཤེས་པ་རིམ་གྲོ་པ། །
en: The family of this victor will be kṣatriya, “And his light will extend five leagues. Distinguished will be his father and Great Jewel his mother. Superior will be his son and Conscientious his attendant.

source: སེང་གེ་རྣམ་པར་སྒྲོགས་པ་མཁས་པ་སྟེ། །
en: Lion Voice will be the scholar

source: འཇམ་པའི་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Gentle Light the one of miracles.

source: འདུས་པ་དང་པོར་བྱེ་བ་དགུ་བཅུ་ཡོད། །གཉིས་པར་བརྒྱད་ཅུ་གསུམ་པར་དྲུག་ཅུ་ཡོད། །
en: In the first congregation there will be nine hundred million, In the second there will be eight hundred, and in the third there will be six hundred.

source: དེ་ན་མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད། །ལོ་ཡི་གྲངས་ནི་བདུན་ཁྲི་བཞི་སྟོང་ཡིན། །
en: The lifespan of humans “Will be seventy-four thousand years,

source: དངོས་པོ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་ཕྲག་ནི་ཉི་ཤུར་གནས། །
en: And when he has gone beyond entities His sacred Dharma will remain for two hundred million years.

source: རྒྱལ་བའི་མཆོད་རྟེན་སྐུ་གདུང་བཅས་པའི་གྲངས། །བྱེ་བ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བཞི་འབྱུང་། །
en: The number of stūpas and relics of this victorious one “Will number nine hundred forty billion.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ནས་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་ལྟ་ཞེས་བྱ། །
en: The thus-gone Nikhiladarśin will be born In a place called Looking at the World.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ལག་བཟངས་ཡིན། །སེང་གེའི་བློ་གྲོས་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཡོན་ཏན་འོད་ཡིན་མྱ་ངན་རིམ་གྲོ་པ། །
en: His family will be brahmin, “And his light will extend three leagues. Excellent Hand will be his father and Lion Intelligence his mother. Luminous Qualities will be his son and Suffering his attendant.

source: གྲགས་ཆེན་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: “And Great Fame the one of miracles.

source: དགྲ་བཅོམ་བྱེ་བ་བདུན་ཅུ་རྩ་བཞི་སྟེ། །འདུས་པ་གཉིས་པར་བདུན་ཅུ་རྩ་ལྔ་ཡོད། །འདུས་པ་གསུམ་པར་བདུན་ཅུ་རྩ་ཡང་དྲུག །
en: Seven hundred forty million worthy ones will gather. In the second congregation will be seven hundred fifty million, And in the third there will be seven hundred sixty million.

source: སྐུ་ཚེ་ལོ་གྲངས་བྱེ་བ་བདུན་ཅུ་ཡིན། །
en: “The lifespan of humans will be seven hundred million years,

source: རྡུལ་དང་བྲལ་བ་ཟད་མཐར་མཛད་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་ཕྲག་དགུར་གནས། །
en: And when this immaculate one has reached exhaustion His sacred Dharma will remain for ninety million years.

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ་ཡོད་དེ། །གསེར་གྱིས་བརྒྱན་ཅིང་རིན་པོ་ཆེ་ཡིས་སྤྲས། །
en: There will be three billion stūpas “Decorated with gold and studded with jewels.

source: བདེ་བར་གཤེགས་པ་ཡོན་ཏན་འོད་གསལ་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་མཐོང་ཞེས་བྱ། །
en: The well-gone one Guṇaprabhāsa will be born In a place called Seeing Awakening.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཀུན་ཏུ་བྱེ་བ་ཡབ་ནི་དགྲ་ཐུལ་ཡིན། །བརྟུལ་ཞུགས་དྲག་ལྡན་ཞེས་བྱ་ཡུམ་ཡིན་ནོ། །
en: His family will be kṣatriya, “And his light will extend ten million leagues. Enemy Subjugator will be his father and Endowed with Fierce Yogic Discipline his mother.

source: སྲས་པོ་བདེ་དགའ་དགའ་བོ་རིམ་གྲོ་པ། །
en: Blissful Joy will be his son and Joyous his attendant.

source: ལྟ་སེམས་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Attentive View will be the scholar
